[
      
    
            {        
            "speakerPicture": "Register",
            "speakerName": "Registration + Tea/Coffee",
            "speakerId": "registration-day-1",
            "talkTitle":"",
            "featured": true,
            "sortOrder": 1,
            "time":"08:00 - 10:00",
            "day":1
            },            
        {              
            "speakerPicture": "KiranKumarAbburi",
            "speakerName": "Kiran Kumar Abburi",
            "speakerDescription":"Co-Organiser of React Bangalore",
            "speakerId": "workshop-intro",
            "talkTitle":"Workshop: Introduction to GraphQL",
            "featured": false,
            "sortOrder": 1,
            "talkAbstract":"Kiran Kumar Abburi, Co-Organiser of React Bangalore, will be giving you an introduction to GraphQL and advanced concepts of GraphQL. This workshop targets beginners of GraphQL getting their introduction and getting their first hands-on experience with GraphQL.",
            "time":"08:30 - 10:00",
            "twitter":"kiran_abburi",
            "type": "workshop",
            "day":1
            },            
            {            
            "speakerPicture": "GraphQLAsiaRajoshiTobias",
            "speakerName": "Welcome by Rajoshi & Tobias",
            "speakerId": "welcome",            
            "talkTitle":"",    
            "featured": true,
            "sortOrder": 1,
            "time":"10:00 - 10:20",
            "day":1
            },
        {
          "speakerPicture": "LeeByron",
          "speakerName": "Lee Byron",
          "speakerId": "lee-byron",          
          "isLightningTalk":false,
          "speakerDescription":"",
          "speakerPosition":"Co-Creator of GraphQL, Senior Software Engineer, Robinhood",
          "type":"talk",
          "talkTitle":"GraphQL Asia Keynote",
          "featured": true,
          "sortOrder": 1,
          "twitter":"leeb",
          "time":"10:20 - 11:00",
          "day":1
        },
        {
          "speakerPicture": "RobertZhu",
          "speakerName": "Robert Zhu",
          "speakerId": "robert-zhu",          
          "isLightningTalk":false,
          "speakerDescription":"ex-Facebook, ex-Microsoft",
          "speakerPosition":"AWS",
          "type":"talk",
          "talkTitle":"Why you should use REST instead of GraphQL",
          "featured": true,
          "sortOrder": 230,
          "talkAbstract":"In this talk, my goal is to equip you with steel man arguments for using REST instead of GraphQL so that you are prepared for common counter-arguments to GraphQL adoption. We’ll discuss REST fundamentals and how it compares to GraphQL on multiple dimension with hands-on examples.",
          "talkDescriptionHTML":"<p>He who knows only his own side of the case knows little of that” -John Stuart Mill</p><p>How will you convince your teammates and customers to use GraphQL? Chances are, they’re already familiar with REST. In this talk, my goal is to equip you with steel man arguments for using REST instead of GraphQL so that you are prepared for common counter-arguments to GraphQL adoption. We’ll discuss REST fundamentals and how it compares to GraphQL on multiple dimension with hands-on examples.</p>",          
          "twitter":"rbzhu",
          "time":"11:00 - 11:30",
          "day":1
        },
        {
          "speakerPicture": "RajatKhare",
          "speakerName": "Rajat Khare",
          "speakerId": "rajat-khare",          
          "isLightningTalk":false,
          "speakerDescription":"Rajat works as a Software Architect with Intuit,  building Applications and Services for Self Employed and Small Business Owners to cater to their Business Management, Accounting and Employee management needs. He has over 16 years of industry experience building high quality, scalable and fault tolerant applications and services across Health care, Automotive and Finance domains.",
          "speakerPosition":"Architect, Intuit",
          "type":"talk",
          "talkTitle":"Running Intuit Quickbooks for 4M customers on Graphql!",
          "talkAbstract":"Share the journey of embracing GraphQL at scale in entire Intuit Quickbooks product over the last 2 years , serving over 4 Million customers worldwide, and give an inside sneek peak into our rich learning around the benefits, opportunities and challenges that we went through while transforming an existing Dojo/ REST API based application to this stack, and having  both UI Widgets and services to adopt GraphQL.",
          "featured": true,
          "sortOrder": 210,
          "twitter":"rajatontwit",
          "time":"11:30 - 12:00",
          "day":1
        },
        {          
          "speakerPicture": "Break",
          "speakerName": "Break",
          "speakerId": "break-2-day-1",
          "isLightningTalk":false,
          "time":"12:00 - 12:10",
          "day":1
      },
        {
          "speakerPicture": "TanayPratap",
          "speakerName": "Tanay Pratap",
          "speakerId": "tanay-pratap",          
          "isLightningTalk":false,
          "speakerDescription":"Rewriting and revamping Microsoft's fastest growing app i.e. Microsoft Teams using React and Apollo.",
          "speakerPosition":"Software Engineer, Microsoft",
          "type":"talk",
          "talkTitle":"Rewriting Wiki in Teams with Apollo+GraphQL at Microsoft's scale",
          "featured": true,
          "sortOrder": 250,
          "talkAbstract":"Teams is the fastest growing product of Microsoft. The talk is about how we rewrote the existing Angular+REST based Wiki App into React+Apollo+GraphQL at Microsoft’s scale and we have a story to tell. A story, which I wished someone had told me before I got into leading this effort.",
          "talkDescriptionHTML":"Teams is the fastest growing product of Microsoft. The talk is about how we rewrote the existing Angular+REST based Wiki App into React+Apollo+GraphQL. This is a full stack rewrite of an app at Microsoft’s scale and we have a story to tell. The story which starts from stack selection, goes through deep diving into it while writing the app and figuring out tonnes of stuff along the way which someone would’t find in docs, blogs, tutorials, courses or anywhere. Think about creating the first ever GraphQL backend in Teams, even getting the leadership to agree was a big task. At Microsoft, we don’t run behind anything shiny, we have to prove that this is the best possible solution. Once, we were done with that we had to figure out the entire stack, how would a C#( also, why not NodeJS?) based GraphQL server interact with Apollo based frontend. You don’t get all the benefits which Apollo provides. Even simple things like schema sharing, type generation (yes! the entire frontend is in typescript), error code sharing are things which you have to figure out yourself. There are the challenges of writing any app in any stack which you have to figure out for this one as well, like, schema finalization, iterative growth, code flow, best practices, unit testing at both ends, integration testing, performance measurement and tuning and a lot of other things. Like for performance tuning, we ran internal experiments, went through the entire source code of Apollo. How to use Apollo Client middle-wares to extract common logic out? Query as component or client.query? Multiple questions ensured a lot of us was left on us to figure out. Also, this app is a co-authoring app, so how do you do locking/unlocking without doing subscription? How do you listen to GraphQL at one end and also respond to some of the old REST endpoints. As if that was not enough, there are services dependency on long poll. I am telling you things mount over each other so quick! These are recipes, one will encounter only when one solves such hard problems. This is a story, which I wished someone had told me before I got into leading this effort.",
          "twitter":"tanaypratap",
          "time":"12:10 - 12:40",
          "day":1
        },
        {
          "speakerPicture": "TobiasMeixner",
          "speakerName": "Tobias Meixner",
          "speakerId": "tobias-meixner",          
          "isLightningTalk":false,
          "speakerDescription":"Co-Organizer @graphqlasia and GraphQL Bangkok, Certified AWS Solution Architect, Serverless & GraphQL fanatic",
          "speakerPosition":"Co-Founder & CTO, BrikL",
          "type":"talk",
          "talkTitle":"BrikL - A GraphQL native",
          "featured": true,
          "sortOrder": 180,
          "talkAbstract": "BrikL's GraphQL journey started in 2016 with constantly changing business requirements towards finding the product market fit. The talk will share some insights on the journey and lessons learnt of a startup using GraphQL to enable high development velocity and how BrikL is using GraphQL today.",
          "twitter":"MeixnerTobias",
          "time":"12:40 - 13:10",
          "day":1
        },        
            {      
                "speakerPicture": "Lunch",
                "speakerName": "Lunch break",
                "speakerId": "lunch-day-1",                
                "isLightningTalk":false,
                "time":"13:10 - 14:10",
                "day":1
            },
            {      
                "speakerPicture": "LucasMunhoz",
                "speakerName": "Lucas Munhoz",
                "speakerId": "react-workshop",                
                "speakerDescription":"Lucas Munhoz is a full-stack developer and organiser of GraphQL Bangkok meetup.",
                "speakerPosition":"Full-stack developer & Co-Organiser of GraphQL Bangkok meetup",
                "type":"talk",
                "talkTitle":"Workshop: React + GraphQL",
                "featured": true,
                "sortOrder": 280,
                "talkAbstract": "Lucas Munhoz will be teaching you on getting started with React and GraphQL using Apollo Client.",
                "isLightningTalk":false,
                "time":"13:30 - 15:00",
                "twitter": "lnmunhoz",
                "day":1
            },
            {
          "speakerPicture": "ShrutiKapoor",
          "speakerName": "Shruti Kapoor",
          "speakerId": "shruti-kapoor",          
          "isLightningTalk":false,
          "speakerDescription":"",
          "speakerPosition":"Software Engineer, Paypal",
          "type":"talk",
          "talkTitle":"GraphQL and State Management",
          "featured": true,
          "sortOrder": 80,
          "twitter":"shrutikapoor08",
          "time":"14:10 - 14:40",
          "day":1
        },
        {
          "speakerPicture": "AkankshaChoudhary",
          "speakerName": "Akanksha Choudhary",
          "speakerId": "akanksha-choudhary",          
          "isLightningTalk":true,
          "speakerDescription":"Akanksha Choudhary is a Tech Lead at Kidovators, developing technology to facilitate 21st Century skills learning.",
          "speakerPosition":"Full Stack Web Developer",
          "type":"talk",
          "talkTitle":"The Cost of GraphQL",
          "featured": true,
          "sortOrder": 110,
          "talkAbstract":"REST has been around for a while now and implementing GraphQL into existing apps take time. Cost of GraphQL is basically the time it is taking for startups to adapt GraphQL. Akanksha is a developer at Kidovators (an eduTech startup for kids) and Akanksha will share her story of adapting GraphQL in her company.",
          "talkDescriptionHTML":"REST has been around for a while now and implementing GraphQL into existing apps take time. Cost of GraphQL is basically the time it takes for a small startup to adapt GraphQL over the entire stack. I am the solo developer at Kidovators (an eduTech startup for kids) and I want to share my story of adapting Apollo/GraphQL in my company. We’re using Redux+REST for our app but the ever growing features in it forced us to re-think our strategy. There are two main reasons any startup scaling in India should adapt Apollo/GraphQL strategy: 1. API calls don’t increase with the number of features. 2. Eliminating over-fetching saves precious data on client. Like for our case, our app is being used by kids from schools in rural areas across India. This was a great motivator to shift to GraphQL.",
          "twitter":"ch_akanksha",
          "time":"14:40 - 14:48",
          "day":1
        },
        {
          "speakerPicture": "EeshTyagi",
          "speakerName": "Eesh Tyagi",
          "speakerId": "eesh-tyagi",          
          "isLightningTalk":true,
          "speakerDescription":"Lead UI Developer @Cleartrip Takes care of UI UX of different products and innovating usage of upcoming front end technologies. An avid Chelsea football fan and gamer by night.",
          "speakerPosition":"Lead UI, Cleartrip",
          "type":"talk",
          "talkTitle":"Cleartrip reactive journey from 3 to 0.2s using Apollo GraphQL - a Case Study",
          "featured": true,
          "sortOrder": 140,
          "talkAbstract":"We are building a single GraphQL endpoint @Cleartrip to remove the dependency of the react client with the Rest API. This will avoid the unnecessary over fetching of verbose data and manipulation on the client, making the react client cleaner and faster (3 → 0.2s document load).",
          "talkDescriptionHTML":"<p>We migrated from old legacy code to React Progressive Web App for Cleartrip hotels but the page load time was still significantly high. Problems were two-fold.</p><h2>First Problem.</h2>          We were doing multiple API calls and fetching extra data not required by mobile as the API is common across the website and mobile. Our first solution was to create another API for PWA client to give less data. We quickly realized it is not scalable and the turnaround time and maintenance effort for creating a separate version of API for PWA was huge.</p><h2>Second Problem.</h2><p>The data received was from different API calls and verbose in nature because of which the client ended up in calculating the derived data required to render fields. For example - the logic to filter and sort the data was implemented on the client which was creating unnecessary overhead on the browser.</p><h2>Solution.</h2><p>GraphQL with Apollo client and Apollo server.</p><p>We created our own GraphQL endpoint whose source of truth will be all the current API’s needed to render hotels. This transformation layer will give the client only that derived data which is required. Not a single thing more or less.</p><p>No manipulation required in client side , all fields given by GraphQL are the formated fields that the client renderer requires.</p><p>The intended audience for this talk is anyone, React specialists or not.</p><p>I’ll start the talk by explaining how GraphQl can make the life of a frontend developer easier by not depending on API versioning system and getting exactly what they need. Then I will briefly explain the Apollo client and server wrapper around GraphQL and how to use it with React.</p><p>I will talk about the implementation of the cursor based pagination using GraphQL which led to 3 → 0.2 s document load time in Cleartrip Hotels list page.</p><p>This whole talk will be justified by real time metrics captured while in development and production.</p>",
          "twitter":"EtEesh",
          "time":"14:50 - 14:58",
          "day":1
        },
        {
          "speakerPicture": "IvanGoncharov",
          "speakerName": "Ivan Goncharov",
          "speakerId": "ivan-goncharov",          
          "isLightningTalk":true,
          "speakerDescription":"Ivan is the maintainer of graphql-js and active contributor to GraphQL Specification.",
          "speakerPosition":"GraphQL consultant, apis.guru",
          "type":"talk",
          "talkTitle":"GraphQL Tools are easy or how to write one in less than 100 lines",
          "featured": true,
          "sortOrder": 150,
          "talkAbstract":"It’s the exciting time for GraphQL ecosystem. New tools appear almost every day and you may have a few ideas for your own. But working with queries and type system looks scary at first sight. In my talk, I will prove the opposite and demonstrate how you can write a useful tool in <100 lines",
          "talkDescriptionHTML":"It’s the exciting time for GraphQL ecosystem. New tools appear almost every day and you may have a few ideas for your own. But working with queries and type system looks scary at first sight. In my talk, I will prove the opposite and demonstrate how you can write a useful tool in less than 100 lines of code. I will explain a few useful concepts like Introspection, AST, schema and how to use graphql-js utils to work with them.",
          "twitter":"E1Goncharov",
          "time":"15:00 - 15:08",
          "day":1
        },
        {          
                "speakerPicture": "Coffee",
                "speakerName": "Coffee break",
                "speakerId": "break-2-day-1",
                "isLightningTalk":false,
                "time":"15:10 - 15:30",
                "day":1
            },
        {
          "speakerPicture": "SashaSolomon",
          "speakerName": "Sasha Solomon",
          "speakerId": "sasha-solomon",          
          "isLightningTalk":false,
          "speakerDescription":"Sasha is a Senior Software Engineer at Twitter on the GraphQL team. She was previously the Tech Lead of the Platforms team at Medium working on GraphQL as well. She has spoken at GraphQL Conf, Scale by the Bay, and other meetups on various topics related to GraphQL and infrastructure. In her spare time, she enjoys tabletop RPGs, karaoke, and most recently, building mechanical keyboards.",
          "speakerPosition":"Senior Software Engineer, Twitter",
          "type":"talk",
          "talkTitle":"200 OK! Error Handling in GraphQL",
          "talkAbstract": "We all know what happens in GraphQL when things are going well, but what happens when things don't go so well? How do you handle errors in GraphQL? Find out how not all errors are created equal, or aren't even errors at all, and how to model \"alternative results\" in your GraphQL schema.",
          "featured": true,
          "sortOrder": 20,
          "twitter":"sachee",
          "time":"15:30 - 16:00",
          "day":1
        },
        {
          "speakerPicture": "MadhuJahagirdar",
          "speakerName": "Madhu Jahagirdar",
          "speakerId": "madhu-jahagirdar",          
          "isLightningTalk":false,
          "speakerDescription":"Madhu Jahagirdar is the Principal Architect & Head of Engineering and Design at Radiology Solutions within the imaging space at Philips. He’s passionate about transforming the human race using technology and compassion. Madhu has worked extensively in software architecture including Big data Analytics, Real Time Analytics, WebScale Architecture, Low latency web applications, Search Engine Architecture, Service Architecture, Mobile Architecture on IOS and Android Platforms. He has Bachelor of Engineering in Electronics and Communication from India, along with several certifications from MIT and  University of Washington, including in the areas of Business Administration, Human computer Interface design, Network Engineering, Information Security and Risk management. Madhu is currently pursuing additional certification in Advanced Certificate for Executives from MIT.. ",
          "speakerPosition":"Principal Architect, Philips",
          "type":"talk",
          "talkTitle":"How GraphQL adds strategic value at every stage of the digital transformation process - stories from Philips Healthcare",
          "featured": true,
          "sortOrder": 40,
          "talkAbstract":"In this talk, I will talk about the digital transformation that we’re going through at Philips Healthcare and how we’re using GraphQL to create value at every stage of the process. The aim of this talk is to share GraphQL use-cases in an enterprise environment. I will cover the major phases of the digital transformation process, the stakeholders involved and the GraphQL value add, including MVP creation, product iteration and unifying customer experience across products. I hope that the audience can take away learnings around how GraphQL can add value in their workplace, and how they can “sell” GraphQL to their team, especially in enterprise contexts.",
          "twitter":"madhujahagirdar",
          "time":"16:00 - 16:30",
          "day":1
        },
                
        {
          "speakerPicture": "AndreasMarek",
          "speakerName": "Andreas Marek",
          "speakerId": "andreas-marek",          
          "isLightningTalk":false,
          "speakerDescription":"Creator and maintainer of GraphQL Java. Working on GraphQL at Atlassian. Living in Sydney.",
          "speakerPosition":"Senior Developer, Atlassian",
          "type":"talk",
          "talkTitle":"GraphQL execution in-depth",
          "featured": true,
          "sortOrder": 120,
          "talkAbstract":"You understand GraphQL, but you would like to really know how GraphQL works? So join us a for a in-depth explanation of how a GraphQL query is actually executed.",
          "talkDescriptionHTML":"<p>You understand how to use GraphQL, but you want to go deeper and know how GraphQL really works? You want to understand the challenges of implementing it or maybe implement it yourself?</p><p>This means you want to know: - what the GraphQL specification says about execution - why only objects really matter - why non null handling is special - what the implicit dependency graph</p><p>Join us for a deep dive on those questions and leave with a in-depth knowledge about GraphQL execution.</p>",
          "twitter":"andimarek",
          "time":"16:30 - 17:00",          
          "day":1
        },    
        {          
          "speakerPicture": "Break",
          "speakerName": "Break",
          "speakerId": "break-3-day-1",
          "isLightningTalk":false,
          "time":"17:00 - 17:10",
          "day":1
      },
        {
          "speakerPicture": "UriGoldshtein",
          "speakerName": "Uri Goldshtein",
          "speakerId": "uri-goldshtein",          
          "isLightningTalk":false,
          "speakerDescription":"Uri is the founder of The Guild, a group of open source developers working around the world to help create important open source libraries, mostly around GraphQL and to support large companies go through successful technological transformations.",
          "speakerPosition":"The Guild",
          "type":"talk",
          "talkTitle":"GraphQL where it hurts the most - Practical tools to use GraphQL in the harshest environments",
          "featured": true,
          "sortOrder": 90,
          "twitter":"urigoldshtein",
          "time":"17:10 - 17:40",
          "dayHalf": "pm",
          "day":1
        },
        {
          "speakerPicture": "RichardThrelkeld",
          "speakerName": "Richard Threlkeld",
          "speakerId": "richard-threlkeld",          
          "isLightningTalk":false,
          "speakerDescription":"Richard Threlkeld is a Sr. Engineer in AWS Mobile and was the founding member of AWS AppSync and Amplify teams. Previously he worked in the field helping customers build web and mobile solutions with AWS technologies, including data processing for AdTech and Gaming industries. Today, he is responsible for the end to end experience for customers building mobile and web applications in the Amplify Framework.",
          "speakerPosition":"Sr. Engineer, AWS (Mobile)",
          "type":"talk",
          "talkTitle":"Web and native clients – GraphQL design patterns for realtime and offline app architecture",
          "featured": true,
          "sortOrder": 220,
          "talkAbstract": "A deep dive into native mobile and web app development with GraphQL, specifically on learnings from the past 2 years of working with customers who are building these apps. Richard will detail tradeoffs in application design across JS, iOS, and Android as well as subscription and offline programming scenarios with how this relates to GraphQL. Finally he will talk about the architecture patterns that you can use on the backend to make the applications simpler and what is scalable in different scenarios.",
          "twitter":"undef_obj",
          "time":"17:40 - 6:10",
          "dayHalf": "pm",
          "day":1
        },        
        {          
            "speakerPicture": "Register",
            "speakerName": "Registration + Tea/Coffee",
            "speakerId": "registration-day-2",            
            "talkTitle":"",
            "featured": true,
            "sortOrder": 1,
            "time":"08:00 - 10:00",
            "day":2            
        },
        {          
                "speakerPicture": "GerardSans",
                "speakerName": "Gerard Sans",
                "speakerId": "workshop-aws-amplify",                
                "speakerDescription":"Gerard is a Developer Advocate at AWS. He is very excited about the future of the Web and JavaScript. Always happy Computer Science Engineer and humble Angular GDE. He loves to share his learnings by giving talks, trainings and writing about cool technologies. He loves running AngularZone and GraphQL London, mentoring students and giving back to the community.",
                "speakerPosition":"Developer Advocate, AWS",
                "type":"talk",
                "talkTitle":"Workshop: Building your first Fullstack Serverless App with AWS Amplify",
                "featured": true,
                "sortOrder": 1000,
                "talkAbstract": "In this workshop we will be introducing AWS Amplify a modern toolchain, libraries and UI components to build modern Fullstack Serverless Apps. You will be building a fully featured Application from development to production. ",
                "isLightningTalk":false,
                "time":"8:30 - 10:00",
                "twitter": "gerardsans",                
                "day":2
        },
        {
          "speakerPicture": "ManojAwasthi",
          "speakerName": "Manoj Awasthi",
          "speakerId": "manoj-awasthi",          
          "isLightningTalk":false,
          "speakerDescription":"Manoj Awasthi is the VP of Engineering at Tokopedia, leading engineering tribes for Discovery, Ads, Seller Platform, Operations and Risk. Prior to Tokopedia, he worked at Adobe. Manoj received an engineering degree in Computer Science from NIT, Allahabad in India.",
          "speakerPosition":"VP of Engineering, Tokopedia",
          "type":"talk",
          "talkTitle":"GraphQL @ Tokopedia",
          "talkAbstract": "A quick walk through our experience adopting GraphQL at the scale of Tokopedia. Problems we solved and faced.",
          "featured": true,
          "sortOrder": 60,
          "twitter":"awmanoj",
          "time":"10:00 - 10:30",
          "day":2
        },
        {
          "speakerPicture": "TanmaiGopal",
          "speakerName": "Tanmai Gopal",
          "speakerId": "tanmai-gopal",          
          "isLightningTalk":false,
          "speakerDescription":"Tanmai Gopal is the CEO, co-founder of Hasura. He is a StackOverflow powered fullstack developer whose areas of interest and work span react, GraphQL, nodejs, haskell, docker, postgres & kubernetes. He is passionate about making it easy to build complex things and is the instructor of India's largest MOOC imad.tech with over 250,000 students.",
          "speakerPosition":"Co-Founder, Hasura",
          "type":"talk",
          "talkTitle":"Building a high-performance realtime GraphQL API on existing databases and data sources",
          "talkAbstract":"In this talk, I will talk about the approach we took at Hasura of building a GraphQL API that can leverage an existing database. I will cover the approach that we took of building a declarative authorization system, addressing the n+1 database query problem and other performance improvements. I’ll also touch upon “realtime” GraphQL (live-queries vs events) and what approach Hasura took. And achieving performance/scalability.With GraphQL making it easy to “join data” across tables, I’ll also talk about how we extend that idea, to “join data” between a table and an existing API.",
          "featured": true,
          "sortOrder": 100,
          "twitter":"tanmaigo",
          "time":"10:30 - 11:00",
          "day":2
        },
        {
          "speakerPicture": "KenjuWagatsuma",
          "speakerName": "Kenju Wagatsuma",
          "speakerId": "kenju-wagatsuma",          
          "isLightningTalk":false,
          "speakerDescription":"Developing the online advertising server.",
          "speakerPosition":"Software Engineer, Cookpad",
          "type":"talk",
          "talkTitle":"Re-architecture of a decade-old app with BFF/GraphQL",
          "featured": true,
          "sortOrder": 170,
          "talkAbstract":"We re-architected a decade-old application in 1 year, and the codebase has been improved drastically. Audiences will see how to refactor “Legacy System” by… - abstracting business logic to BFF - implementing BFF layer with GraphQL (micro services) - handling complex state management and so on.",
          "talkDescriptionHTML":"We re-architected a decade-old application in 1 year, and the codebase has been improved drastically. Audiences will see how to refactor “Legacy System” by… - abstracting business logic to BFF - implementing BFF layer with GraphQL (micro services) - handling complex state management - introducing static analysis/CI/CD/Unit Testing/BDD, etc. There were NO JavaScript tests at all. jQuery was 1.x (the latest version was 3.x then), and many other libraries are far behind the latest. So many dead codes and not used libraries. I believe that, audiences can learn a lot from our experiences & knowledges to refactor Legacy Systems in practices. TOC This talk will be composed from 3 parts: [Introduction] Describe our app architecture & share the background [Technical Parts] Explain our new architecture (BFF/GraphQL/React) [Theory Parts] Practical lessons for refactoring “Legacy System”",
          "twitter":"itiskj",
          "time":"11:00 - 11:30",
          "day":2
        },        
        {
          "speakerPicture": "KamleshChandnani",
          "speakerName": "Kamlesh Chandnani",
          "speakerId": "kamlesh-chandnani",
          
          "isLightningTalk":false,
          "speakerDescription":"Kamlesh is an Associate Architect Frontend @TreeboHotels. He co-organizes ReactJS Meetup Bangalore (India) . He is an open source enthusiast and the one who's obsessed with Web Performance. He finds peace at beaches!",
          "speakerPosition":"Associate Frontend Architect, Treebo Hotels",
          "type":"talk",
          "talkTitle":"Subscriptions - A roller coaster ride!",
          "featured": true,
          "sortOrder": 160,
          "talkAbstract":"All of us know GraphQL subscriptions are meant to build real time applications. But what’s behind the scenes is rarely talked about. What are subscriptions really? Why do they exist? How do we make a case for subscriptions to our managers? Let’s ride a roller coaster!",
          "talkDescriptionHTML":"Imagine you’ve an application of a Hotel Booking System which is being used by a front desk manager at the Hotel Reception. Now your PM has a requirement and this how the the conversation begins: Manager: Hey, we have a page of Booking Details and we want to keep it up to date in real time. Developer (Immediate response): Can’t the user refresh the page or can’t we refresh the page at certain interval? 🤔 Manager: Eyebrows up and weird look!! 😠 Developer (After scratching his head): since I’ve a GraphQL query for fetching the total number of bookings for a particular hotel I’ll add polling to the query and I’ll be done 🚀  Manager: Awesome go ahead. Developer implements the feature and now comes the time for UAT Manager: This doesn’t really feels real time though! Developer: Okay I’ll change the polling frequency. Manager: Naah still doesn’t feels like real time though! Developer: What to do now 🤦🏻‍♂️!! Already messed up with the codebase. Developer (To Himself): I think subscriptions can solve this? But I’m not sure. I don’t really know what all it will take? Also I don’t know how to make a case and convince my manager that subscriptions are the one shot go for all these use cases. So this talk is about demonstrating what all pieces are required to create a real time application and why do we need all those pieces, so at the end of the day you can go back to work and convince your managers what value subscriptions can bring in to your products.",
          "twitter":"_kamlesh_",
          "time":"11:30 - 12:00",
          "day":2
        },  
        {
          "speakerPicture": "PeriNikhil",
          "speakerName": "Peri Nikhil",
          "speakerId": "peri-nikhil",  
          "mergeWith": "kamlesh-chandnani",        
          "isLightningTalk":false,
          "speakerDescription":"An adrenaline junkie who is always hungry, hyperactive and happy. Enjoys a variety of things like beat-boxing, swimming, trekking, socializing, and of course, lazing on the couch",
          "speakerPosition":"Senior Frontend Engineer, Treebo Hotels",
          "type":"talk",
          "talkTitle":"Subscriptions - A roller coaster ride!",
          "featured": true,
          "sortOrder": 2000,
          "talkAbstract":"All of us know GraphQL subscriptions are meant to build real time applications. But what’s behind the scenes is rarely talked about. What are subscriptions really? Why do they exist? How do we make a case for subscriptions to our managers? Let’s ride a roller coaster!",
          "talkDescriptionHTML":"Imagine you’ve an application of a Hotel Booking System which is being used by a front desk manager at the Hotel Reception. Now your PM has a requirement and this how the the conversation begins: Manager: Hey, we have a page of Booking Details and we want to keep it up to date in real time. Developer (Immediate response): Can’t the user refresh the page or can’t we refresh the page at certain interval? 🤔 Manager: Eyebrows up and weird look!! 😠 Developer (After scratching his head): since I’ve a GraphQL query for fetching the total number of bookings for a particular hotel I’ll add polling to the query and I’ll be done 🚀  Manager: Awesome go ahead. Developer implements the feature and now comes the time for UAT Manager: This doesn’t really feels real time though! Developer: Okay I’ll change the polling frequency. Manager: Naah still doesn’t feels like real time though! Developer: What to do now 🤦🏻‍♂️!! Already messed up with the codebase. Developer (To Himself): I think subscriptions can solve this? But I’m not sure. I don’t really know what all it will take? Also I don’t know how to make a case and convince my manager that subscriptions are the one shot go for all these use cases. So this talk is about demonstrating what all pieces are required to create a real time application and why do we need all those pieces, so at the end of the day you can go back to work and convince your managers what value subscriptions can bring in to your products.",
          "twitter":"peri_nikhil",
          "time":"11:30 - 12:00",
          "day":2
        },  
        {          
          "speakerPicture": "Break",
          "speakerName": "Break",
          "speakerId": "break-0-day-2",
          "isLightningTalk":false,
          "time":"12:00 - 12:10",
          "day":2
      },      
        {
          "speakerPicture": "ShawnSwyxWang",
          "speakerName": "Shawn Wang",
          "speakerId": "shawn-wang",          
          "isLightningTalk":false,
          "speakerDescription":"swyx is an Infinite Builder working on Developer Experience at Netlify. In his free time he helps people Learn in Public at Egghead.io and /r/reactjs.",
          "speakerPosition":"Developer Experience, Netlify",
          "type":"talk",
          "talkTitle":"Serverless GraphQL",
          "featured": true,
          "sortOrder": 280,
          "talkAbstract":"GraphQL is often synonymous with the return of Monolithic architecture. Does this mean the benefits of Serverless are irrelevant? In this talk we explore how Serverless and GraphQL work together, explore ways to stitch individual function schemas, and get hard numbers to fight performance concerns.",
          "talkDescriptionHTML":"This talk is a gentle reintroduction to the serverless movement for skeptics, who may not have been paying attention to all the GraphQL capabilities that are slowly emerging even on the Serverless side because most tutorials assume monolithic architectures. Nothing in the spec requires a monolith, and in fact resolvers are all mini-serverless functions anyway. We just lack the tools and wholistic viewpoint to address this gap in the market. In this talk we will discuss what we’re doing at Netlify to fix that",
          "twitter":"swyx",
          "time":"12:10 - 12:40",
          "day":2
        },
        {
          "speakerPicture": "SidharthaChatterjee",
          "speakerName": "Sidhartha Chatterjee",
          "speakerId": "sidhartha-chatterjee",          
          "isLightningTalk":false,
          "speakerDescription":"Sidhartha is a full stack developer based out of Mumbai. He's part of the Gatsby core OSS team. He's worked with several companies in the past including Cleartrip and Insider and has helped them build React apps, PWAs and Node.js microservices. In his free time, he likes scuba diving in the deep seas, playing his guitar and walking his dog.",
          "speakerPosition":"OSS Maintainer, Gatsby",
          "type":"talk",
          "talkTitle":"Gatsby and GraphQL: Today and the Future",
          "featured": true,
          "sortOrder": 240,
          "talkAbstract":"Gatsby uses GraphQL in a pretty unique way — type inference, automatic filter and connection generation. This talk will be a deep dive in we use GraphQL to support querying data from hundreds of different source plugins. We’ll also look at the future of GraphQL at Gatsby and exciting new features.",
          "talkDescriptionHTML":"Gatsby (amongst other things) is a static site generator with a performance first mindset. Anyone who has used Gatsby has likely used GraphQL because it’s the default way to consume data in Gatsby! Gatsby uses GraphQL in a pretty unique way though. With hundreds of different data sources with different shapes, it is really hard to scale with a type first model. We solve this with type inference in Gatsby. Taking it a step further, we also create connections automatically and generate filters for rich querying! In this talk, we’ll do a deep dive into how Gatsby uses GraphQL. We’ll look at how we do type inference today. We’ll also look at limitations of our current approach and how we’re looking at solving them so that users and plugin authors have a great inference system with solid extension capabilities. Finally, we’ll discuss our plans for the future of GraphQL in Gatsby and exciting upcoming features.",
          "twitter":"chatsidhartha",
          "time":"12:40 - 13:00",
          "day":2
        },
        {          
                "speakerPicture": "DigitalOcean",
                "speakerName": "Digital Ocean",
                "speakerId": "digital-ocean",                
                "isLightningTalk":true,
                "time":"13:00 - 13:05",
                "day":2
            },            
        {         
                "speakerPicture": "Lunch",
                "speakerName": "Lunch break",
                "speakerId": "lunch-day-2",                
                "isLightningTalk":false,
                "time":"13:05 - 14:10",
                "day":2
        },
        {          
                "speakerPicture": "Hasura",
                "speakerName": "",
                "speakerId": "workshop-hasura",                
                "speakerDescription":"",
                "speakerPosition":"",
                "type": "workshop",
                "talkTitle":"Workshop: Building realtime application with GraphQL subscriptions using Hasura", 
                "featured": true,
                "sortOrder": 1,
                "talkAbstract":"",
                "isLightningTalk":false,
                "time":"13:30 - 15:00",
                "day":2
        },
        {
          "speakerPicture": "NavyaAgarwal",
          "speakerName": "Navya Agarwal",
          "speakerId": "navya-agarwal",          
          "isLightningTalk":false,
          "speakerDescription":"Navya is a polyglot developer working with Adobe Experience Cloud. She currently looks after the authentication and orchestration part of the stack with the broad goal of optimizing the performance and scalability of the system. I have tried my hands-on trending technologies and introduced the same in my projects. Over the past years, Navya has dabbled with multiple tech stacks and has worked on various innovative ideas within the team.",
          "speakerPosition":"MTS-II, Adobe",
          "type":"talk",
          "talkTitle":"A glimpse of GraphQL: Front end developers’ life is easy now!",
          "featured": true,
          "sortOrder": 190,
          "talkAbstract":"Aim is to instill within audience the feeling:”REST APIs are now #RestInPeace APIs Long live GraphQL” by showcasing a case-study.But the journey to GraphQL is not all sunshine & rainbows.The road has certainly been bumpy at times,but in the end we’re really able to recognize the benefits of GraphQL.",
          "talkDescriptionHTML":"In this talk we’ll walk through our journey to GraphQL at Adobe, and highlight a few of our successes and failures along the way. Use Case: We at Adobe Experience Cloud, wanted to redefine our customer’s experience, and as part of this redesign we wanted to focus on surfacing more data (but not at the cost of a performance overhead). This new redesign now required a mix of data from different sources to be rendered on the screen and we began to face many problems around performance, documentation, and general ease-of-use. On many pages, we found ourselves making four or five round-trips to the server to fetch the data and nit picking it at the client side in order to render it. Solving the problem with GraphQL: After some investigation, we thought of integrating GraphQL to our architecture— we decided to add a GraphQL proxy layer on top of our REST APIs. This was a pretty easy process- we built some utilities around making downstream REST calls to fetch data in our resolver, and wrote up some rules around converting our existing models into GraphQL and within a matter of days were ready to call our GraphQL pilot a success. But the real challenges begin now: One of our REST API rolled back to a previous version and suddenly every GraphQL query started failing. And what about caching? The solution to these problems and others that came across as we switched to GraphQL are covered next.",
          "twitter":"",
          "time":"14:10 - 14:40",
          "day":2
        },        
        {
          "speakerPicture": "PeterThomas",
          "speakerName": "Peter Thomas",
          "speakerId": "peter-thomas",          
          "isLightningTalk":true,
          "speakerDescription":"Peter is a full-stack engineer who enjoys building and mentoring technology teams. An avid open-source enthusiast, Peter's first open-source project 'CB2XML' was created on SourceForge way back in 2004 and incredibly still sees active releases by the current maintainers.  His latest open-source initiative is a web-services test-automation framework called 'Karate' - that has racked up 1700+ GitHub \"stars\" in less than two years. Peter also features in the TechBeacon list of \"Test Automation Leaders to Follow in 2019\".",
          "speakerPosition":"Distinguished Engineer, Intuit",
          "type":"talk",
          "talkTitle":"GraphQL Test-Automation with Karate",
          "featured": true,
          "sortOrder": 260,
          "talkAbstract":"Karate is the only open-source tool to combine API test-automation, mocks and performance-testing into a single, unified framework. In this talk, you get to hear from the creator of Karate as to how it greatly simplifies the integration testing of GraphQL. Karate's native support for JSON, JsonPath and JavaScript means that you can zoom into interesting parts of your response payloads and perform complex assertions. This is especially important for GraphQL - since responses are highly dynamic, and do not typically conform to a fixed schema. And since you can run tests in parallel - you can dramatically crunch your test execution time.",
          "talkDescriptionHTML":"<p>Karate is a relatively new open-source framework for testing micro-services. But within just two years, Karate’s adoption by the community has been remarkable, as evident from the rising tide of Stack Overflow questions and the 1400+ stars the project currently has on GitHub. Karate was featured as one of the top 5 open-source API testing tools in a blog post on TechBeacon, within just six months of its release. It now regularly turns up in blog-posts, social-media mentions, and believe it or not – even job-listings as a desired skill.</p><p>Karate has clearly filled a gap in the industry for a simple yet powerful tool that makes easy – the business of dealing with complex HTTP payloads. The unique mix of a Domain Specific Language (DSL), embedded JavaScript engine and native support for JsonPath and XPath makes Karate a great fit for testing GraphQL.</p><p>Karate is the only open-source tool to combine API test-automation, mocks and performance-testing into a single, unified framework. Besides powerful JSON & XML assertions, you can run tests in parallel for speed - which is critical for HTTP API testing.</p><p>In this session you will get to hear from the creator of Karate and understand how it greatly simplifies the integration testing of GraphQL scenarios. Authorization headers, complex response assertions, multiple dynamic calls and data-driven testing are just some of the things Karate can handle.</p>",
          "twitter":"ptrthomas",
          "time":"14:40 - 14:48",
          "day":2
        },      
        {
          "speakerPicture": "CarlosRufo",
          "speakerName": "Carlos Rufo",
          "speakerId": "carlos-rufo",          
          "isLightningTalk":false,
          "speakerDescription":"Carlos is a passionate developer and speaker aficionado. While he codes with different B/FE techs, his go-to for every project is his crush: GraphQL. He is very active in the GraphQL ecosystem where he has collaborated with across numerous internal and external projects, such as HowToGraphQL & SpaceX GraphQL API. In his free time he loves stargazing & rocket science, but mostly, help to build a community where everyone could learn about everything!",
          "speakerPosition":"OSS Developer",
          "type":"talk",
          "talkTitle":"End-to-end Type-Safe GraphQL Apps",
          "featured": true,
          "sortOrder": 130,
          "talkAbstract":"Discover all the steps & benefits for adding End-to-end Type-Safety to your GraphQL Apps with this demo-based lightning talk. At the end of such, you’ll want to refactor your codebase in order to take all the advantages of GraphQL, TypeScript & React working together on a SpaceX demo 🚀",
          "talkDescriptionHTML":"Building applications using type-safety is the new challenge nowadays. JavaScript, as most popular dynamic typed language, comes at the cost of making many mistakes (such as typos, misspellings, etc), here’s where TypeScript comes in. Having a strongly typed GraphQL schema as Single Source of Truth, we’d want to keep the data structures in sync over the whole application to reduce the propensity of errors. This talk discusses the tools and best practices for building full type-safe applications with GraphQL, touching on topics like schema-based code generation, type-safe resolvers, client-documents types and more! *All examples will be based on SpaceX data 🚀",
          "twitter":"swcarlosrj",
          "time":"14:50 - 14:58",          
          "day":2
        },
         {
          "speakerPicture": "JonathanJalouzot",
          "speakerName": "Jonathan Jalouzot",
          "speakerId": "jonathan-jalouzot",          
          "isLightningTalk":true,
          "speakerDescription":"Speaker for more than 4 years on many topics such as the webperformance or the application cache, I’m working for over a year with ApolloJs and I advocate GraphQL to the French community through meetups. I animated the GraphQL track during Api Days.",
          "speakerPosition":"Co-Founder, GraphQL Paris",
          "type":"talk",
          "talkTitle":"How to Implement an extension aiming to track and monitor the performance of the GraphQL API",
          "featured": true,
          "sortOrder": 50,
          "talkAbstract":"How to monitor the performance of your API graph. I propose you to set up an extension in ApolloJS that will allow you to monitor your GraphQl API with your favorite tools such as an ELK",
          "twitter":"CaptainJojo42",
          "time":"15:00 - 15:08",
          "day":2
        },
        {          
                "speakerPicture": "Coffee",
                "speakerName": "Coffee break",
                "speakerId": "break-2-day-2",                
                "isLightningTalk":false,
                "time":"15:10 - 15:30",
                "day":2
        },
        {
          "speakerPicture": "KiranKumarAbburi",
          "speakerName": "Kiran Kumar Abburi",
          "speakerId": "kiran-kumar-abburi",          
          "isLightningTalk":false,
          "speakerDescription":"Kiran Abburi is a Freelance developer and he primarily work with React, React Native and GraphQL.  He also organises Reactjs Bangalore meetup and contributes to opensource.",
          "speakerPosition":"Organiser of @ReactBangalore",
          "type":"talk",
          "talkTitle":"Live Queries implementation with Apollo & GraphQL",
          "featured": true,
          "sortOrder": 270,
          "talkAbstract":"Subscriptions are useful to implement real time updates. However, Implementing subscriptions is time consuming and hard to maintain. It also effects performance of app as the number of subscriptions increase. Live queries is an alternative proposal to implement real-time updates. @live directive on a regular GraphQL query makes it a Live Query. Frameworks should take care of keeping the data of live queries in sync between client and server. But Apollo don’t support live queries yet. So, we implemented our own live query system with GraphQL & Apollo. In this talk, I will present how to implement Live Query system that keeps data in sync between Client and server automatically.",
          "talkDescriptionHTML":"Subscriptions are useful to implement real time updates. However, Implementing subscriptions is time consuming and hard to maintain. It also effects performance of app as the number of subscriptions increase. Live queries is an alternative proposal to implement real-time updates. @live directive on a regular GraphQL query makes it a Live Query. Frameworks should take care of keeping the data of live queries in sync between client and server. But Apollo don’t support live queries yet. So, we implemented our own live query system with GraphQL & Apollo. In this talk, I will present how to implement Live Query system that keeps data in sync between Client and server automatically.",
          "twitter":"kiran_abburi",
          "time":"15:30 - 16:00",
          "day":2
        },              
        {
          "speakerPicture": "TimGriesser",
          "speakerName": "Tim Griesser",
          "speakerId": "tim-griesser",          
          "isLightningTalk":false,
          "speakerDescription":"Tim is a Senior Software Engineer at Cypress.io. An enthusiast of GraphQL and TypeScript, he enjoys building things for the web and collaborating on open source, creating libraries such as Knex.js and GraphQL Nexus. He is passionate about learning from and teaching the best ideas from different languages and frameworks.",
          "speakerPosition":"Senior Software Engineer, cypress.io",
          "type":"talk",
          "talkTitle":"Paving a New Path for GraphQL Schemas",
          "featured": true,
          "sortOrder": 200,
          "talkAbstract":"Schema-first (SDL) development is common in the JS ecosystem, yet isn’t in most other languages. Why? What if we challenged this “best practice” with something even better - a library with a declarative API and full type safety out of the box - without needing manual type-annotation (even in JS)!",
          "twitter":"tgriesser",
          "time":"16:00 - 16:30",
          "day":2
        },
        {          
          "speakerPicture": "Break",
          "speakerName": "Break",
          "speakerId": "break-4-day-2",
          "isLightningTalk":false,
          "time":"16:30 - 16:40",
          "day":2
      },
        {
          "speakerPicture": "AmitRana",
          "speakerName": "Amit Rana",
          "speakerId": "amit-rana",          
          "isLightningTalk":false,
          "speakerDescription":"",
          "speakerPosition":"Director of Engineering, Myntra",
          "type":"talk",
          "talkTitle":"Scaling Myntra API Gateway to 30kqps built on Go lang with GraphQL",
          "featured": true,
          "sortOrder": 30,
          "twitter":"",
          "time":"16:40 - 17:10",
          "day":2
        },
        {
          "speakerPicture": "AdamMiskiewicz",
          "speakerName": "Adam Miskiewicz",
          "speakerId": "adam-miskiewicz",          
          "isLightningTalk":false,
          "speakerDescription":"Adam Miskiewicz is an Engineer at Airbnb working primarily on Airbnb's emerging GraphQL infrastructure. Adam has over 12 years of experience building web and mobile applications, and has been using GraphQL in production since the day it was open-sourced. Adam lives in San Francisco with his lovely fiancé Ashly and their two Pomeranians, Ace and Jack.",
          "speakerPosition":"Engineer, Airbnb",
          "type":"talk",
          "talkTitle":"Adopting GraphQL @ Airbnb",
          "talkAbstract":"With the vibrant and growing GraphQL ecosystem and community, it's simpler than ever to start using GraphQL in your project. However, adopting GraphQL incrementally (and carefully!) in huge codebases powering large distributed systems is not quite as straightforward. We'll dive into how Airbnb is tackling this challenge, what we've learned so far, and how we plan to continue evolving our GraphQL infrastructure in the future.",
          "featured": true,
          "sortOrder": 70,
          "twitter":"skevy",
          "time":"17:10 - 17:40",          
          "day":2
        },
        {
          "speakerPicture": "GraphQLAsiaRajoshiTobias",
          "speakerName": "Rajoshi & Tobias",
          "speakerId": "closing",          
          "isLightningTalk":false,
          "speakerDescription":"",
          "speakerPosition":"",
          "type":"talk",
          "talkTitle":"Closing",
          "featured": true,
          "sortOrder": 1,
          "twitter":"",
          "time":"17:40 - 18:00",
          "dayHalf": "pm",
          "day":2
        }
]
